index.org
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link href='http://fonts.googleapis.com/css?family=Vollkorn' rel='stylesheet' type='text/css'>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD_EXTRA:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+LATEX_HEADER:
#+OPTIONS: author:nil toc:nil ^:nil  timestamp:nil num:nil
#+TITLE: Wieland Hoffmann

This is the +end of the internet+ GitHub page of Wieland Hoffmann.
You can find me at various places around the web, including [[https://github.com/mineo/][GitHub]],
[[https://musicbrainz.org/user/Mineo][MusicBrainz]] and the [[https://unix.stackexchange.com/users/4699/wieland][Unix & Linux Stack Exchange]].

Other than that, there's not much to see here at the moment, except
for a short list of software I've written or contributed to.  For a
more complete list, check out [[https://www.openhub.net/accounts/mineo][my Open Hub profile]].

* Projects
** Applications
   :PROPERTIES:
   :CUSTOM_ID: applications
   :END:

- [[https://lala.readthedocs.org/en/latest/][lala]] is an IRC bot written in the Python programming language.
- [[https://sagbescheid.readthedocs.org/en/latest/][sagbescheid]] is a notification daemon for state changes in [[http://freedesktop.org/wiki/Software/systemd/][systemd]] units.
- [[https://github.com/mineo/dhis][dhist]] can be used to create a list of information (including cover
  art) for a users most listened to albums, as tracked by [[https://last.fm][last.fm]].
- [[https://github.com/mineo/hgidr][hgidr]] is an application that helps me keep track of TV shows I've
  seen by saving information about the last seen episode of each show.
- [[https://pypi.python.org/pypi/mplayer-autocmd][mplayer-autocmd]] provides per-file options and keybindings for the [[http://mpv.io/][mpv]]
  media player.

** Libraries
   :PROPERTIES:
   :CUSTOM_ID: libraries
   :END:
- [[https://pypi.python.org/pypi/enumerate_skip/][enumerate_skip]] is a library that extends Pythons [[https://docs.python.org/2/library/functions.html#enumerate][enumerate]]
  function with methods to adjust the count values returned while
  iterating over it.
- [[https://github.com/mineo/yatemplate][yatemplate]] is an Emacs library that uses [[https://capitaomorte.github.io/yasnippet/][YASnippet]] to provide file templates.

** MusicBrainz
   :PROPERTIES:
   :CUSTOM_ID: musicbrainz
   :END:

I'm a regular contributor to the MusicBrainz project, contributing
both data and code.

So far, most of the code that I wrote for the project has been in one
of the following projects:

- [[https://github.com/mineo/gocaa][gocaa]] is a library written in the [[http://golang.org/][Go]] programming language to
  access data in the [[https://coverartarchive.org/][Cover Art Archive]].
- [[https://github.com/mineo/mb2wikidatabot][mb2wikidatabot]] is an application to automatically enter [[https://musicbrainz.org][MusicBrainz]]
  identifiers into [[https://wikidata.org][Wikidata]].
- [[https://github.com/mineo/mb-places-map][mb-places-map]] is a map showing all places with coordinates in the
  [[https://musicbrainz.org][MusicBrainz]] database. You can view it [[http://mbsandbox.org/~mineo/places/places.html][online]].
- [[https://picard.musicbrainz.org/][MusicBrainz Picard]] is an application for tagging and renaming audio
  files.
- [[https://python-musicbrainzngs.readthedocs.org/en/latest/][python-musicbrainzngs]] is a library for accessing MusicBrainz data in Python.
