index.html
<!DOCTYPE html>
<html>
<head>
<title>Wieland Hoffmann</title>
<!-- 2015-06-18 Do 10:10 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<link href='//fonts.googleapis.com/css?family=Vollkorn' rel='stylesheet' type='text/css'>
<link rel='stylesheet' type='text/css' href='style.css' /> 
</head>
<body>
<div id="content">
<h1 class="title">Wieland Hoffmann</h1>
<p>
This is the <del>end of the internet</del> GitHub page of Wieland Hoffmann.
You can find me at various places around the web, including <a href="https://github.com/mineo/">GitHub</a>,
<a href="https://musicbrainz.org/user/Mineo">MusicBrainz</a> and the <a href="https://unix.stackexchange.com/users/4699/wieland">Unix &amp; Linux Stack Exchange</a>.
</p>

<p>
Other than that, there's not much to see here at the moment, except
for a short list of software I've written or contributed to.  For a
more complete list, check out <a href="https://www.openhub.net/accounts/mineo">my Open Hub profile</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Projects</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-applications" class="outline-3">
<h3 id="applications"><a id="sec-1-1" name="sec-1-1"></a>Applications</h3>
<div class="outline-text-3" id="text-applications">

<ul class="org-ul">
<li><a href="https://lala.readthedocs.org/en/latest/">lala</a> is an IRC bot written in the Python programming language.
</li>
<li><a href="https://sagbescheid.readthedocs.org/en/latest/">sagbescheid</a> is a notification daemon for state changes in <a href="http://freedesktop.org/wiki/Software/systemd/">systemd</a> units.
</li>
<li><a href="https://github.com/mineo/dhis">dhist</a> can be used to create a list of information (including cover
art) for a users most listened to albums, as tracked by <a href="https://last.fm">last.fm</a>.
</li>
<li><a href="https://github.com/mineo/hgidr">hgidr</a> is an application that helps me keep track of TV shows I've
seen by saving information about the last seen episode of each show.
</li>
<li><a href="https://pypi.python.org/pypi/mplayer-autocmd">mplayer-autocmd</a> provides per-file options and keybindings for the <a href="http://mpv.io/">mpv</a>
  media player.
</li>
</ul>
</div>
</div>

<div id="outline-container-libraries" class="outline-3">
<h3 id="libraries"><a id="sec-1-2" name="sec-1-2"></a>Libraries</h3>
<div class="outline-text-3" id="text-libraries">
<ul class="org-ul">
<li><a href="https://pypi.python.org/pypi/enumerate_skip/">enumerate_skip</a> is a library that extends Pythons <a href="https://docs.python.org/2/library/functions.html#enumerate">enumerate</a>
function with methods to adjust the count values returned while
iterating over it.
</li>
<li><a href="https://github.com/mineo/yatemplate">yatemplate</a> is an Emacs library that uses <a href="https://capitaomorte.github.io/yasnippet/">YASnippet</a> to provide file templates.
</li>
</ul>
</div>
</div>

<div id="outline-container-musicbrainz" class="outline-3">
<h3 id="musicbrainz"><a id="sec-1-3" name="sec-1-3"></a>MusicBrainz</h3>
<div class="outline-text-3" id="text-musicbrainz">

<p>
I'm a regular contributor to the MusicBrainz project, contributing
both data and code.
</p>

<p>
So far, most of the code that I wrote for the project has been in one
of the following projects:
</p>

<ul class="org-ul">
<li><a href="https://github.com/mineo/gocaa">gocaa</a> is a library written in the <a href="http://golang.org/">Go</a> programming language to
access data in the <a href="https://coverartarchive.org/">Cover Art Archive</a>.
</li>
<li><a href="https://github.com/mineo/mb2wikidatabot">mb2wikidatabot</a> is an application to automatically enter <a href="https://musicbrainz.org">MusicBrainz</a>
  identifiers into <a href="https://wikidata.org">Wikidata</a>.
</li>
<li><a href="https://github.com/mineo/mb-places-map">mb-places-map</a> is a map showing all places with coordinates in the
<a href="https://musicbrainz.org">MusicBrainz</a> database. You can view it <a href="http://mbsandbox.org/~mineo/places/places.html">online</a>.
</li>
<li><a href="https://picard.musicbrainz.org/">MusicBrainz Picard</a> is an application for tagging and renaming audio
files.
</li>
<li><a href="https://python-musicbrainzngs.readthedocs.org/en/latest/">python-musicbrainzngs</a> is a library for accessing MusicBrainz data in Python.
</li>
</ul>

<p>
<a href="quotes.html">Quotes</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-06-18 Do 10:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
